Revit 2027 API
BuiltInFailures.RoofFailures.RoofToRefPlanesError Property
 Roof cannot be joined to more than one reference plane.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RoofToRefPlanesError { get; }
Public Shared ReadOnly Property RoofToRefPlanesError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RoofToRefPlanesError {
	FailureDefinitionId^ get ();
}
static member RoofToRefPlanesError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RoofFailures Class
Autodesk.Revit.DB Namespace